#include <stdio.h>
#include <stdlib.h>

int main()
{
	int i = -20;
	unsigned int j = 10;
	printf("%d\n", i + j);
	//i为有符号数，j为无符号数，当i与j相加时i需要提升为无符号
	//i原码为
	//10000000 00000000 00000000 00010100
	//反码为
	//11111111 11111111 11111111 11101011
	//补码为
	//11111111 11111111 11111111 11101100
	//i的原码为
	//00000000 00000000 00000000 00001010
	//相加得到
	//11111111 11111111 11111111 11110110
	//但输出时要求以%d的形式，即需要转为有符号，而看二进制得知符号位为1，需要转为原码
	//转反码需-1
	//11111111 11111111 11111111 11110101
	//取反
	//10000000 00000000 00000000 00001010
	//即为-10
	system("pause");
	return 0;
}